In [6]:
#import libraries
import numpy as np
import pandas as pd

In [7]:
#load data
df_main =pd.read_csv("train_data.csv")

In [8]:
df_main.head()

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,Bachelor's,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,PhD,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,Master's,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,PhD,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,Master's,Self-employed,Married,Yes,No,Business,True,0

In [9]:
df_main.shape

(225347, 18)

In [10]:
df_main.isnull().sum()

Investor_ID                           0
Age                               32840
Annual_Income                     22626
Investment_Amount                 18033
Risk_Tolerance_Score                  0
Months_of_Investing_Experience        0
Number_of_Active_Investments       4512
Potential_Return_Rate             11244
Investment_Duration                   0
Investment_to_Income_Ratio            0
Education                             0
Employment_Status                     0
Marital_Status                    42906
Owns_Property                         0
Has_Dependents                        0
Investment_Sector                     0
Has_Investment_Advisor             3849
Investment_Failed                     0
dtype: int64

In [11]:
#summary for data
df_main.describe()

,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Investment_Failed
count,192507.000000,202721.000000,207314.000000,225347.000000,225347.000000,220835.000000,214103.000000,225347.000000,225347.000000,225347.000000
mean,46.026004,82793.709196,126997.235204,598.569708,59.832942,2.498413,13.417184,36.028756,0.499736,0.087212
std,19.066572,38856.728908,70766.875540,186.348988,34.617474,1.116728,6.628983,16.968128,0.230821,0.282146
min,18.000000,15000.000000,5000.000000,300.000000,0.000000,1.000000,2.000000,12.000000,0.100000,0.000000
25%,31.000000,49293.000000,65589.250000,445.000000,30.000000,2.000000,7.700000,24.000000,0.300000,0.000000
50%,45.000000,82908.000000,126790.500000,589.000000,60.000000,2.000000,13.350000,36.000000,0.500000,0.000000
75%,58.000000,116369.000000,188104.500000,735.000000,90.000000,3.000000,19.160000,48.000000,0.700000,0.000000
max,119.000000,149999.000000,249999.000000,1099.000000,119.000000,4.000000,25.000000,60.000000,0.900000,1.000000

In [12]:
#label encoder for education column
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()
df_main['Education'] = labelencoder.fit_transform(df_main['Education'])

In [13]:
#read column Education
df_main['Education'].value_counts()

Education
0    56748
3    56258
2    56224
1    56117
Name: count, dtype: int64

In [14]:
df_main.head()

,Investor_ID,Age,Annual_Income,Investment_Amount,Risk_Tolerance_Score,Months_of_Investing_Experience,Number_of_Active_Investments,Potential_Return_Rate,Investment_Duration,Investment_to_Income_Ratio,Education,Employment_Status,Marital_Status,Owns_Property,Has_Dependents,Investment_Sector,Has_Investment_Advisor,Investment_Failed
0,0003HW9UAA,51.0,NaN,87300.0,358,13,3.0,18.10,12,0.85,0,Part-time,NaN,No,NO,Other,True,0
1,000ELHLBPV,37.0,81658.0,152598.0,792,23,4.0,14.06,24,0.86,3,Self-employed,NaN,Yes,No,Auto,False,1
2,000G6CHJON,NaN,NaN,77767.0,359,57,4.0,4.31,60,0.60,2,Unemployed,Married,No,No,Education,True,0
3,000K09D0JB,54.0,42344.0,13261.0,366,115,1.0,NaN,60,0.21,3,Part-time,Divorced,No,No,Education,True,0
4,000NTH4YTU,63.0,48898.0,193990.0,792,53,4.0,5.65,48,0.82,2,Self-employed,Married,Yes,No,Business,True,0

In [15]:
#read marital status column
df_main['Marital_Status'].value_counts()

Marital_Status
Divorced    39174
Married     38979
Single      38886
Sgl         21918
Marr        21834
Div         21650
Name: count, dtype: int64

In [18]:
#replace sgl with single, Marr with married, Div with Divorced
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Sgl', 'Single')
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Marr', 'Married')
df_main['Marital_Status'] = df_main['Marital_Status'].replace('Div', 'Divorced')

In [20]:
df_main['Marital_Status'].value_counts()

Marital_Status
Divorced    60824
Married     60813
Single      60804
Name: count, dtype: int64

In [44]:
df_main['Marital_Status'].isnull().sum()

0

In [40]:
import pandas as pd
from sklearn.impute import KNNImputer

# Initialize KNN imputer with k neighbors
knn_imputer = KNNImputer(n_neighbors=5)  # Adjust 'n_neighbors' as needed

# Perform KNN imputation on 'Marital_Status' column
df_main['Marital_Status'] = knn_imputer.fit_transform(df_main[['Marital_Status']])

In [27]:
# Convert 'Marital_Status' column to integer type
df_main['Marital_Status'] = df_main['Marital_Status'].astype(int)

# Label encode the 'Marital_Status' column
labelencoder = LabelEncoder()
df_main['Marital_Status'] = labelencoder.fit_transform(df_main['Marital_Status'])

In [33]:
# Apply KNNImputer
imputer = KNNImputer(n_neighbors=3)
df_main['Marital_Status'] = imputer.fit_transform(df_main[['Marital_Status']])
df_main['Marital_Status'] = df_main['Marital_Status'].round()

In [41]:

df_main['Marital_Status'].isnull().sum()

0

In [42]:
df_main['Marital_Status'].value_counts()

Marital_Status
0.0    60824
1.0    60813
2.0    60804
3.0    42906
Name: count, dtype: int64

In [43]:
#unique values in marital status column
df_main['Marital_Status'].unique()

array([3., 1., 0., 2.])